# Напишите программу вывода на экран трех последовательно идущих чисел, каждое на отдельной строке. Первое число вводит пользователь, остальные числа вычисляются в программе.
# Допустим
# на вход подается число
# 10
# принт
# 10
#
# 11
# 12

a = int(input())

print(a)
print(a+1)
print(a+2)